// Разработайте смоук тест-сьют с тестами на REGISTER на странице 
//  https://anatoly-karpovich.github.io/demo-login-form/

// Требования:
//  Страница регистрации:
//      Username: обязательное, от 3 до 40 символов включительно, запрещены префиксные/постфиксные 
//                 пробелы, как и имя состоящее из одних пробелов
//      Password: обязательное, от 8 до 20 символов включительно, необходима хотя бы одна буква 
//                в верхнем и нижнем регистрах, пароль из одних пробелов запрещен
//  Страница логина:
//      Username: обязательное
//      Password: обязательное